cfd/openfoam/12_simpleFoam_forceCoefs/0.orig/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}

// ************************************************************************** //

#include "include/boundaryConditions"

// ************************************************************************** //

dimensions [ 0 1 -1 0 0 0 0 ];

// ************************************************************************** //

internalField   uniform ($flowVelocity 0 0);

// ************************************************************************** //

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  uniform ( 0 0 0 );
        value       $internalField;
    }

    walls
    {
        type        slip;
    }
    
    model
    {
        type        noSlip;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************** //
