cfd/openfoam/12_simpleFoam_forceCoefs/0.orig/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

// ************************************************************************** //

#include "include/boundaryConditions"

// ************************************************************************** //

dimensions [ 0 2 -2 0 0 0 0 ];

// ************************************************************************** //

internalField uniform $turbulentKE;

// ************************************************************************** //

boundaryField
{
    inlet
    {
        type        fixedValue;
        value       $internalField;
    }

    outlet
    {
        type        inletOutlet;
        inletValue  $internalField;
        value       $internalField;
    }
    
    walls
    {
        type        slip;
    }

    model
    {
        type        kqRWallFunction;
        value       $internalField;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************** //
