cfd/openfoam/12_simpleFoam_forceCoefs/0.orig/nut
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}

// ************************************************************************** //

#include "include/boundaryConditions"

// ************************************************************************** //

dimensions [ 0 2 -1 0 0 0 0 ];

// ************************************************************************** //

internalField uniform $turbulentVisc;

// ************************************************************************** //

boundaryField
{
    inlet
    {
        type        calculated;
        value       uniform 0;
    }

    outlet
    {
        type        calculated;
        value       uniform 0;
    }

    walls
    {
        type        calculated;
        value       uniform 0;
    }

    model
    {
        type        nutkWallFunction;
        value       uniform 0;
    }
    
    "proc.*"
    {
        type        processor;
    }
}

// ************************************************************************** //
