cfd/openfoam/12_simpleFoam_forceCoefs/system/forceCoeffs
// ************************************************************************** //
// Force coefficients post-processor functions
// ************************************************************************** //

#include "$FOAM_CASE/0/include/boundaryConditions"
#include "include/referenceData"

// ************************************************************************** //

forceCoeffs_Cx_Cz_Cmy
{
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (model);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.0;         // Redundant for incompressible
    liftDir         (0 0 1);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 1 0);
    magUInf         $flowVelocity;
    lRef            $referenceLengthPitch;
    Aref            $referenceArea;
}

// ************************************************************************** //

forceCoeffs_Cx_Cy_Cmx
{
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (model);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.0;         // Redundant for incompressible
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (1 0 0);
    magUInf         $flowVelocity;
    lRef            $referenceLengthRoll;
    Aref            $referenceArea;
}

// ************************************************************************** //

forceCoeffs_Cx_Cy_Cmz
{
    type            forceCoeffs;

    libs            ("libforces.so");

    writeControl    timeStep;
    timeInterval    1;

    log             yes;

    patches         (model);
    rho             rhoInf;      // Indicates incompressible
    rhoInf          1.0;         // Redundant for incompressible
    liftDir         (0 1 0);
    dragDir         (1 0 0);
    CofR            (0 0 0);
    pitchAxis       (0 0 1);
    magUInf         $flowVelocity;
    lRef            $referenceLengthYaw;
    Aref            $referenceArea;
}

// ************************************************************************** //
