cfd/openfoam/12_simpleFoam_forceCoefs/system/include/referenceData
// ************************************************************************** //
// Reference data for force coefficient computations
// ************************************************************************** //

referenceLengthRoll     2.302;
referenceLengthPitch    2.302;
referenceLengthYaw      2.302;

referenceArea           5.748e-2;

// ************************************************************************** //
